docs/loadtest-results/2026-07-27T09-55-37-354Z/k6-shard-0.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 110 max VUs, 1m40s max duration (incl. graceful stop):
              * sustained_ramp: Up to 100.00 iterations/s for 1m10s over 3 stages (maxVUs: 30-110, gracefulStop: 30s)


running (0m01.0s), 000/030 VUs, 2 complete and 0 interrupted iterations
sustained_ramp   [   1% ] 000/030 VUs  0m01.0s/1m10s  004.97 iters/s

running (0m02.0s), 000/030 VUs, 9 complete and 0 interrupted iterations
sustained_ramp   [   3% ] 000/030 VUs  0m02.0s/1m10s  009.74 iters/s

running (0m03.0s), 000/030 VUs, 21 complete and 0 interrupted iterations
sustained_ramp   [   4% ] 000/030 VUs  0m03.0s/1m10s  014.66 iters/s

running (0m04.0s), 000/030 VUs, 38 complete and 0 interrupted iterations
sustained_ramp   [   6% ] 000/030 VUs  0m04.0s/1m10s  019.62 iters/s

running (0m05.0s), 001/030 VUs, 60 complete and 0 interrupted iterations
sustained_ramp   [   7% ] 001/030 VUs  0m05.0s/1m10s  024.80 iters/s

running (0m06.0s), 001/030 VUs, 87 complete and 0 interrupted iterations
sustained_ramp   [   9% ] 001/030 VUs  0m06.0s/1m10s  029.75 iters/s

running (0m07.0s), 000/030 VUs, 120 complete and 0 interrupted iterations
sustained_ramp   [  10% ] 000/030 VUs  0m07.0s/1m10s  034.71 iters/s

running (0m08.0s), 001/030 VUs, 157 complete and 0 interrupted iterations
sustained_ramp   [  11% ] 001/030 VUs  0m08.0s/1m10s  039.81 iters/s

running (0m09.0s), 001/030 VUs, 199 complete and 0 interrupted iterations
sustained_ramp   [  13% ] 001/030 VUs  0m09.0s/1m10s  044.78 iters/s

running (0m10.0s), 000/030 VUs, 247 complete and 0 interrupted iterations
sustained_ramp   [  14% ] 000/030 VUs  0m10.0s/1m10s  049.75 iters/s

running (0m11.0s), 000/030 VUs, 299 complete and 0 interrupted iterations
sustained_ramp   [  16% ] 000/030 VUs  0m11.0s/1m10s  054.73 iters/s

running (0m12.0s), 014/030 VUs, 344 complete and 0 interrupted iterations
sustained_ramp   [  17% ] 014/030 VUs  0m12.0s/1m10s  059.87 iters/s

running (0m13.0s), 001/030 VUs, 418 complete and 0 interrupted iterations
sustained_ramp   [  19% ] 001/030 VUs  0m13.0s/1m10s  064.77 iters/s

running (0m14.0s), 000/030 VUs, 486 complete and 0 interrupted iterations
sustained_ramp   [  20% ] 000/030 VUs  0m14.0s/1m10s  069.75 iters/s

running (0m15.0s), 000/030 VUs, 558 complete and 0 interrupted iterations
sustained_ramp   [  21% ] 000/030 VUs  0m15.0s/1m10s  074.73 iters/s

running (0m16.0s), 000/030 VUs, 635 complete and 0 interrupted iterations
sustained_ramp   [  23% ] 000/030 VUs  0m16.0s/1m10s  079.72 iters/s

running (0m16.9s), 001/030 VUs, 717 complete and 0 interrupted iterations
sustained_ramp   [  24% ] 001/030 VUs  0m17.0s/1m10s  084.76 iters/s

running (0m17.9s), 001/030 VUs, 804 complete and 0 interrupted iterations
sustained_ramp   [  26% ] 001/030 VUs  0m18.0s/1m10s  089.75 iters/s

running (0m18.9s), 000/030 VUs, 897 complete and 0 interrupted iterations
sustained_ramp   [  27% ] 000/030 VUs  0m19.0s/1m10s  094.74 iters/s

running (0m19.9s), 001/030 VUs, 994 complete and 0 interrupted iterations
sustained_ramp   [  29% ] 001/030 VUs  0m20.0s/1m10s  099.77 iters/s

running (0m20.9s), 000/030 VUs, 1094 complete and 0 interrupted iterations
sustained_ramp   [  30% ] 000/030 VUs  0m21.0s/1m10s  100.00 iters/s

running (0m21.9s), 001/030 VUs, 1194 complete and 0 interrupted iterations
sustained_ramp   [  31% ] 001/030 VUs  0m22.0s/1m10s  100.00 iters/s

running (0m22.9s), 001/030 VUs, 1294 complete and 0 interrupted iterations
sustained_ramp   [  33% ] 001/030 VUs  0m23.0s/1m10s  100.00 iters/s

running (0m23.9s), 001/030 VUs, 1394 complete and 0 interrupted iterations
sustained_ramp   [  34% ] 001/030 VUs  0m24.0s/1m10s  100.00 iters/s

running (0m24.9s), 001/030 VUs, 1494 complete and 0 interrupted iterations
sustained_ramp   [  36% ] 001/030 VUs  0m25.0s/1m10s  100.00 iters/s

running (0m25.9s), 000/030 VUs, 1594 complete and 0 interrupted iterations
sustained_ramp   [  37% ] 001/030 VUs  0m26.0s/1m10s  100.00 iters/s

running (0m26.9s), 002/032 VUs, 1660 complete and 0 interrupted iterations
sustained_ramp   [  39% ] 002/032 VUs  0m27.0s/1m10s  100.00 iters/s

running (0m27.9s), 001/032 VUs, 1761 complete and 0 interrupted iterations
sustained_ramp   [  40% ] 001/032 VUs  0m28.0s/1m10s  100.00 iters/s

running (0m28.9s), 001/032 VUs, 1861 complete and 0 interrupted iterations
sustained_ramp   [  41% ] 001/032 VUs  0m29.0s/1m10s  100.00 iters/s

running (0m29.9s), 001/032 VUs, 1961 complete and 0 interrupted iterations
sustained_ramp   [  43% ] 001/032 VUs  0m30.0s/1m10s  100.00 iters/s

running (0m30.9s), 000/032 VUs, 2061 complete and 0 interrupted iterations
sustained_ramp   [  44% ] 000/032 VUs  0m31.0s/1m10s  100.00 iters/s

running (0m31.9s), 001/032 VUs, 2160 complete and 0 interrupted iterations
sustained_ramp   [  46% ] 001/032 VUs  0m32.0s/1m10s  100.00 iters/s

running (0m32.9s), 001/032 VUs, 2261 complete and 0 interrupted iterations
sustained_ramp   [  47% ] 001/032 VUs  0m33.0s/1m10s  100.00 iters/s

running (0m33.9s), 001/032 VUs, 2361 complete and 0 interrupted iterations
sustained_ramp   [  49% ] 001/032 VUs  0m34.0s/1m10s  100.00 iters/s

running (0m34.9s), 001/032 VUs, 2460 complete and 0 interrupted iterations
sustained_ramp   [  50% ] 002/032 VUs  0m35.0s/1m10s  100.00 iters/s

running (0m35.9s), 000/032 VUs, 2561 complete and 0 interrupted iterations
sustained_ramp   [  51% ] 000/032 VUs  0m36.0s/1m10s  100.00 iters/s

running (0m36.9s), 000/032 VUs, 2661 complete and 0 interrupted iterations
sustained_ramp   [  53% ] 000/032 VUs  0m37.0s/1m10s  100.00 iters/s

running (0m37.9s), 001/032 VUs, 2761 complete and 0 interrupted iterations
sustained_ramp   [  54% ] 001/032 VUs  0m38.0s/1m10s  100.00 iters/s

running (0m38.9s), 002/032 VUs, 2860 complete and 0 interrupted iterations
sustained_ramp   [  56% ] 002/032 VUs  0m39.0s/1m10s  100.00 iters/s

running (0m39.9s), 000/032 VUs, 2961 complete and 0 interrupted iterations
sustained_ramp   [  57% ] 000/032 VUs  0m40.0s/1m10s  100.00 iters/s

running (0m40.9s), 001/032 VUs, 3061 complete and 0 interrupted iterations
sustained_ramp   [  59% ] 001/032 VUs  0m41.0s/1m10s  100.00 iters/s

running (0m41.9s), 001/032 VUs, 3161 complete and 0 interrupted iterations
sustained_ramp   [  60% ] 001/032 VUs  0m42.0s/1m10s  100.00 iters/s

running (0m42.9s), 001/032 VUs, 3261 complete and 0 interrupted iterations
sustained_ramp   [  61% ] 001/032 VUs  0m43.0s/1m10s  100.00 iters/s

running (0m43.9s), 001/032 VUs, 3361 complete and 0 interrupted iterations
sustained_ramp   [  63% ] 001/032 VUs  0m44.0s/1m10s  100.00 iters/s

running (0m44.9s), 000/032 VUs, 3461 complete and 0 interrupted iterations
sustained_ramp   [  64% ] 000/032 VUs  0m45.0s/1m10s  100.00 iters/s

running (0m45.9s), 001/032 VUs, 3561 complete and 0 interrupted iterations
sustained_ramp   [  66% ] 001/032 VUs  0m46.0s/1m10s  100.00 iters/s

running (0m46.9s), 001/032 VUs, 3661 complete and 0 interrupted iterations
sustained_ramp   [  67% ] 001/032 VUs  0m47.0s/1m10s  100.00 iters/s

running (0m47.9s), 001/032 VUs, 3761 complete and 0 interrupted iterations
sustained_ramp   [  69% ] 001/032 VUs  0m48.0s/1m10s  100.00 iters/s

running (0m48.9s), 001/032 VUs, 3861 complete and 0 interrupted iterations
sustained_ramp   [  70% ] 001/032 VUs  0m49.0s/1m10s  100.00 iters/s

running (0m49.9s), 001/032 VUs, 3961 complete and 0 interrupted iterations
sustained_ramp   [  71% ] 001/032 VUs  0m50.0s/1m10s  100.00 iters/s

running (0m50.9s), 000/032 VUs, 4061 complete and 0 interrupted iterations
sustained_ramp   [  73% ] 000/032 VUs  0m51.0s/1m10s  100.00 iters/s

running (0m51.9s), 001/032 VUs, 4161 complete and 0 interrupted iterations
sustained_ramp   [  74% ] 001/032 VUs  0m52.0s/1m10s  100.00 iters/s

running (0m52.9s), 002/032 VUs, 4260 complete and 0 interrupted iterations
sustained_ramp   [  76% ] 002/032 VUs  0m53.0s/1m10s  100.00 iters/s

running (0m53.9s), 000/032 VUs, 4361 complete and 0 interrupted iterations
sustained_ramp   [  77% ] 000/032 VUs  0m54.0s/1m10s  100.00 iters/s

running (0m54.9s), 001/032 VUs, 4461 complete and 0 interrupted iterations
sustained_ramp   [  79% ] 001/032 VUs  0m55.0s/1m10s  100.00 iters/s

running (0m55.9s), 001/032 VUs, 4561 complete and 0 interrupted iterations
sustained_ramp   [  80% ] 001/032 VUs  0m56.0s/1m10s  100.00 iters/s

running (0m56.9s), 001/032 VUs, 4661 complete and 0 interrupted iterations
sustained_ramp   [  81% ] 001/032 VUs  0m57.0s/1m10s  100.00 iters/s

running (0m57.9s), 001/032 VUs, 4761 complete and 0 interrupted iterations
sustained_ramp   [  83% ] 001/032 VUs  0m58.0s/1m10s  100.00 iters/s

running (0m58.9s), 001/032 VUs, 4861 complete and 0 interrupted iterations
sustained_ramp   [  84% ] 001/032 VUs  0m59.0s/1m10s  100.00 iters/s

running (0m59.9s), 001/032 VUs, 4960 complete and 0 interrupted iterations
sustained_ramp   [  86% ] 001/032 VUs  1m00.0s/1m10s  100.00 iters/s

running (1m00.9s), 000/032 VUs, 5057 complete and 0 interrupted iterations
sustained_ramp   [  87% ] 000/032 VUs  1m01.0s/1m10s  090.50 iters/s

running (1m01.9s), 001/032 VUs, 5142 complete and 0 interrupted iterations
sustained_ramp   [  89% ] 001/032 VUs  1m02.0s/1m10s  080.44 iters/s

running (1m02.9s), 000/032 VUs, 5218 complete and 0 interrupted iterations
sustained_ramp   [  90% ] 000/032 VUs  1m03.0s/1m10s  070.50 iters/s

running (1m03.9s), 000/032 VUs, 5283 complete and 0 interrupted iterations
sustained_ramp   [  91% ] 000/032 VUs  1m04.0s/1m10s  060.42 iters/s

running (1m04.9s), 000/032 VUs, 5339 complete and 0 interrupted iterations
sustained_ramp   [  93% ] 000/032 VUs  1m05.0s/1m10s  050.50 iters/s

running (1m05.9s), 001/032 VUs, 5384 complete and 0 interrupted iterations
sustained_ramp   [  94% ] 001/032 VUs  1m06.0s/1m10s  040.37 iters/s

running (1m06.9s), 000/032 VUs, 5420 complete and 0 interrupted iterations
sustained_ramp   [  96% ] 000/032 VUs  1m07.0s/1m10s  030.50 iters/s

running (1m07.9s), 000/032 VUs, 5445 complete and 0 interrupted iterations
sustained_ramp   [  97% ] 000/032 VUs  1m08.0s/1m10s  020.74 iters/s

running (1m08.9s), 000/032 VUs, 5461 complete and 0 interrupted iterations
sustained_ramp   [  99% ] 000/032 VUs  1m09.0s/1m10s  010.48 iters/s

running (1m09.9s), 000/032 VUs, 5466 complete and 0 interrupted iterations
sustained_ramp   [ 100% ] 000/032 VUs  1m10.0s/1m10s  002.24 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    signals_accepted_202...........: 1387   19.818795/s
    signals_rate_limited_429.......: 4079   58.284689/s
    signals_sampled_sent...........: 113    1.614653/s

    HTTP
    http_req_duration..............: avg=6.11ms min=900.02µs med=4.05ms max=451.51ms p(50)=4.05ms p(95)=15.13ms p(99)=39.13ms
      { expected_response:true }...: avg=6.11ms min=900.02µs med=4.05ms max=451.51ms p(50)=4.05ms p(95)=15.13ms p(99)=39.13ms
    http_req_failed................: 0.00%  0 out of 5466
    http_reqs......................: 5466   78.103483/s

    EXECUTION
    dropped_iterations.............: 33     0.471536/s
    iteration_duration.............: avg=7.77ms min=1.06ms   med=4.41ms max=618ms    p(50)=4.41ms p(95)=15.73ms p(99)=41.36ms
    iterations.....................: 5466   78.103483/s
    vus............................: 0      min=0         max=11
    vus_max........................: 32     min=30        max=32

    NETWORK
    data_received..................: 6.1 MB 87 kB/s
    data_sent......................: 2.6 MB 37 kB/s



running (1m10.0s), 000/032 VUs, 5466 complete and 0 interrupted iterations
sustained_ramp ✓ [ 100% ] 000/032 VUs  1m10s  002.24 iters/s